; domain
(define (domain satellite)

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object
    direction
)

; ==========================================================
; DIRECTIONS
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento satellite
    (pointing ?d - direction)

    ; evita oscillazioni
    (last-dir ?d - direction)

    ; visibilità oggetti
    (visible ?o - object ?d - direction)

    ; stato invio
    (taken ?o - object)
    (sent ?o - object)

    ; qualità oggetto (NON della foto)
    (quality-hd ?o - object)
    (quality-sd ?o - object)

    ; grafo direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions
    (energy)
    (memory-used)
    (memory-capacity)
    (photo-count)
    (rotation-cost)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE (UNICA)
; ==========================================================

(:action take-picture

    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        (< (photo-count) 2)

        (<= (+ (memory-used) 10) (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (increase (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (increase (memory-used) 10)
        )

        (when (quality-sd ?o)
            (increase (memory-used) 3)
        )
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send
    :parameters (?o - object)

    :precondition (and
        (pointing n)
        (taken ?o)
        (not (sent ?o))
        (>= (energy) 2)
    )

    :effect (and
        (sent ?o)
        (not (taken ?o))

        (decrease (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (decrease (memory-used) 10)
        )

        (when (quality-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-easy)
(:domain satellite)

(:objects
    star1 noise1 - object
)

(:init

    (pointing n)
    (last-dir n)

    (visible star1 e)
    (visible noise1 e)

    (quality-hd star1)
    (quality-sd noise1)

    (= (energy) 20)
    (= (memory-used) 0)
    (= (memory-capacity) 20)
    (= (photo-count) 0)
    (= (rotation-cost) 0)

    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left ne n)
    (next-left e ne)
    (next-left se e)
    (next-left s se)
    (next-left sw s)
    (next-left w sw)
    (next-left nw w)
    (next-left n nw)
)

(:goal
    (and
        (sent star1)
    )
)

(:metric minimize (+ (energy) (rotation-cost)))
)

; plan
1. (rotate-right n ne)
   deleted: (pointing n) (last-dir n)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 0 to 2, (energy) from 20 to 19
   goals met: 0 of 1
2. (rotate-right ne e)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 2 to 4, (energy) from 19 to 18
   goals met: 0 of 1
3. (take-picture star1 e)
   added: (taken star1)
   changed: (photo-count) from 0 to 1, (energy) from 18 to 16, (memory-used) from 0 to 10
   goals met: 0 of 1
4. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 4 to 6, (energy) from 16 to 15
   goals met: 0 of 1
5. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 6 to 8, (energy) from 15 to 14
   goals met: 0 of 1
6. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 1 to 0, (energy) from 14 to 12, (memory-used) from 10 to 0
   goals met: 1 of 1
